ClearDotX/TRK-KEA8_128/LINStack/Examples/S12ZVMC256_example/Carrasomne+_S12ZVMC256/S12ZVMC256_LIN_Master/Project_Headers/mc9s12zvmc256.h
#define DBGDCTL_COMPE_MASK              1U
#define DBGDCTL_RWE_MASK                4U
#define DBGDCTL_RW_MASK                 8U
#define DBGDCTL_INST_MASK               32U


/*** DBGDAH - Debug Comparator D Address Register High; 0x00000145 ***/
typedef union {
  byte Byte;
  struct {
    byte DBGDA       :8;                                       /* Comparator Address Bits */
  } Bits;
} DBGDAHSTR;
extern volatile DBGDAHSTR _DBGDAH @0x00000145;
#define DBGDAH                          _DBGDAH.Byte
#define DBGDAH_DBGDA                    _DBGDAH.Bits.DBGDA

#define DBGDAH_DBGDA_MASK               255U
#define DBGDAH_DBGDA_BITNUM             0U


/*** DBGDAM - Debug Comparator D Address Register Middle; 0x00000146 ***/
typedef union {
  byte Byte;
  struct {
    byte DBGDA       :8;                                       /* Comparator Address Bits */
  } Bits;
} DBGDAMSTR;
extern volatile DBGDAMSTR _DBGDAM @0x00000146;
#define DBGDAM                          _DBGDAM.Byte
#define DBGDAM_DBGDA                    _DBGDAM.Bits.DBGDA

#define DBGDAM_DBGDA_MASK               255U
#define DBGDAM_DBGDA_BITNUM             0U


/*** DBGDAL - Debug Comparator D Address Register Low; 0x00000147 ***/
typedef union {
  byte Byte;
  struct {
    byte DBGDA       :8;                                       /* Comparator Address Bits */
  } Bits;
} DBGDALSTR;
extern volatile DBGDALSTR _DBGDAL @0x00000147;
#define DBGDAL                          _DBGDAL.Byte
#define DBGDAL_DBGDA                    _DBGDAL.Bits.DBGDA

#define DBGDAL_DBGDA_MASK               255U
#define DBGDAL_DBGDA_BITNUM             0U


/*** MODRR0 - Module Routing Register 0; 0x00000200 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte SCI1RR      :1;                                       /* SCI1 routing */
    byte SPI0RR      :1;                                       /* SPI routing */
    byte SPI0SSRR    :1;                                       /* SPI SS routing */
    byte             :1; 
    byte             :1; 
  } Bits;
} MODRR0STR;
extern volatile MODRR0STR _MODRR0 @0x00000200;
#define MODRR0                          _MODRR0.Byte
#define MODRR0_SCI1RR                   _MODRR0.Bits.SCI1RR
#define MODRR0_SPI0RR                   _MODRR0.Bits.SPI0RR
#define MODRR0_SPI0SSRR                 _MODRR0.Bits.SPI0SSRR
/* MODRR_ARR: Access 3 MODRRx registers in an array */
#define MODRR_ARR                       ((volatile byte *) &MODRR0)

#define MODRR0_SCI1RR_MASK              8U
#define MODRR0_SPI0RR_MASK              16U
#define MODRR0_SPI0SSRR_MASK            32U


/*** MODRR1 - Module Routing Register 1; 0x00000201 ***/
typedef union {
  byte Byte;
  struct {
    byte PWM10RR     :1;                                       /* PWM0 and PWM1 routing */
    byte PWM32RR     :1;                                       /* PWM2 and PWM3 routing */
    byte PWM54RR     :1;                                       /* PWM4 and PWM5 routing */
    byte PWMPRR      :2;                                       /* PWM probe0 */
    byte M0C0RR      :3;                                       /* MSCAN-CANPHY routing0 */
  } Bits;
} MODRR1STR;
extern volatile MODRR1STR _MODRR1 @0x00000201;
#define MODRR1                          _MODRR1.Byte
#define MODRR1_PWM10RR                  _MODRR1.Bits.PWM10RR
#define MODRR1_PWM32RR                  _MODRR1.Bits.PWM32RR
#define MODRR1_PWM54RR                  _MODRR1.Bits.PWM54RR
#define MODRR1_PWMPRR                   _MODRR1.Bits.PWMPRR
#define MODRR1_M0C0RR                   _MODRR1.Bits.M0C0RR

#define MODRR1_PWM10RR_MASK             1U
#define MODRR1_PWM32RR_MASK             2U
#define MODRR1_PWM54RR_MASK             4U
#define MODRR1_PWMPRR_MASK              24U
#define MODRR1_PWMPRR_BITNUM            3U
#define MODRR1_M0C0RR_MASK              224U
#define MODRR1_M0C0RR_BITNUM            5U


/*** MODRR2 - Module Routing Register 2; 0x00000202 ***/
typedef union {
  byte Byte;
  struct {
    byte T0IC1RR0    :1;                                       /* TIM0 IC1 routing option 0 */
    byte T0IC1RR     :1;                                       /* TIM IC1 routing */
    byte T0IC3RR     :2;                                       /* TIM IC3 routing */
    byte             :1; 
    byte T0C1RR      :1;                                       /* TIM0 IOC0_1 routing */
    byte T0C2RR      :2;                                       /* TIM0 IOC0_2 routing */
  } Bits;
} MODRR2STR;
extern volatile MODRR2STR _MODRR2 @0x00000202;
#define MODRR2                          _MODRR2.Byte
#define MODRR2_T0IC1RR0                 _MODRR2.Bits.T0IC1RR0
#define MODRR2_T0IC1RR                  _MODRR2.Bits.T0IC1RR
#define MODRR2_T0IC3RR                  _MODRR2.Bits.T0IC3RR
#define MODRR2_T0C1RR                   _MODRR2.Bits.T0C1RR
#define MODRR2_T0C2RR                   _MODRR2.Bits.T0C2RR

#define MODRR2_T0IC1RR0_MASK            1U
#define MODRR2_T0IC1RR_MASK             2U
#define MODRR2_T0IC3RR_MASK             12U
#define MODRR2_T0IC3RR_BITNUM           2U
#define MODRR2_T0C1RR_MASK              32U
#define MODRR2_T0C2RR_MASK              192U
#define MODRR2_T0C2RR_BITNUM            6U


/*** ECLKCTL - ECLK Control Register; 0x00000208 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte NECLK       :1;                                       /* No ECLK */
  } Bits;
} ECLKCTLSTR;
extern volatile ECLKCTLSTR _ECLKCTL @0x00000208;
#define ECLKCTL                         _ECLKCTL.Byte
#define ECLKCTL_NECLK                   _ECLKCTL.Bits.NECLK

#define ECLKCTL_NECLK_MASK              128U


/*** IRQCR - Interrupt Control Register; 0x00000209 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte IRQEN       :1;                                       /* IRQ Enable */
    byte IRQE        :1;                                       /* IRQ Select Edge Sensitive Only */
  } Bits;
} IRQCRSTR;
extern volatile IRQCRSTR _IRQCR @0x00000209;
#define IRQCR                           _IRQCR.Byte
#define IRQCR_IRQEN                     _IRQCR.Bits.IRQEN
#define IRQCR_IRQE                      _IRQCR.Bits.IRQE

#define IRQCR_IRQEN_MASK                64U
#define IRQCR_IRQE_MASK                 128U


/*** PIMMISC - PIM Miscellaneous Register; 0x0000020A ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte OCPE1       :1;                                       /* Activate over-current detector on PP0 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} PIMMISCSTR;
