ClearDotX/TRK-KEA8_128/LINStack/Examples/S12ZVMC256_example/Carrasomne+_S12ZVMC256/S12ZVMC256_LIN_Master/Project_Headers/mc9s12zvmc256.h
#define PWMSCLB_BIT0_MASK               1U
#define PWMSCLB_BIT1_MASK               2U
#define PWMSCLB_BIT2_MASK               4U
#define PWMSCLB_BIT3_MASK               8U
#define PWMSCLB_BIT4_MASK               16U
#define PWMSCLB_BIT5_MASK               32U
#define PWMSCLB_BIT6_MASK               64U
#define PWMSCLB_BIT7_MASK               128U


/*** PWMCNT0 - PWM Channel Counter 0 Register; 0x0000048C ***/
typedef union {
  byte Byte;
} PWMCNT0STR;
extern volatile PWMCNT0STR _PWMCNT0 @0x0000048C;
#define PWMCNT0                         _PWMCNT0.Byte
/* PWMCNT_ARR: Access 8 PWMCNTx registers in an array */
#define PWMCNT_ARR                      ((volatile byte *) &PWMCNT0)


/*** PWMCNT1 - PWM Channel Counter 1 Register; 0x0000048D ***/
typedef union {
  byte Byte;
} PWMCNT1STR;
extern volatile PWMCNT1STR _PWMCNT1 @0x0000048D;
#define PWMCNT1                         _PWMCNT1.Byte


/*** PWMCNT2 - PWM Channel Counter 2 Register; 0x0000048E ***/
typedef union {
  byte Byte;
} PWMCNT2STR;
extern volatile PWMCNT2STR _PWMCNT2 @0x0000048E;
#define PWMCNT2                         _PWMCNT2.Byte


/*** PWMCNT3 - PWM Channel Counter 3 Register; 0x0000048F ***/
typedef union {
  byte Byte;
} PWMCNT3STR;
extern volatile PWMCNT3STR _PWMCNT3 @0x0000048F;
#define PWMCNT3                         _PWMCNT3.Byte


/*** PWMCNT4 - PWM Channel Counter 4 Register; 0x00000490 ***/
typedef union {
  byte Byte;
} PWMCNT4STR;
extern volatile PWMCNT4STR _PWMCNT4 @0x00000490;
#define PWMCNT4                         _PWMCNT4.Byte


/*** PWMCNT5 - PWM Channel Counter 5 Register; 0x00000491 ***/
typedef union {
  byte Byte;
} PWMCNT5STR;
extern volatile PWMCNT5STR _PWMCNT5 @0x00000491;
#define PWMCNT5                         _PWMCNT5.Byte


/*** PWMCNT6 - PWM Channel Counter 6 Register; 0x00000492 ***/
typedef union {
  byte Byte;
} PWMCNT6STR;
extern volatile PWMCNT6STR _PWMCNT6 @0x00000492;
#define PWMCNT6                         _PWMCNT6.Byte


/*** PWMCNT7 - PWM Channel Counter 7 Register; 0x00000493 ***/
typedef union {
  byte Byte;
} PWMCNT7STR;
extern volatile PWMCNT7STR _PWMCNT7 @0x00000493;
#define PWMCNT7                         _PWMCNT7.Byte


/*** PWMPER0 - PWM Channel Period 0 Register; 0x00000494 ***/
typedef union {
  byte Byte;
} PWMPER0STR;
extern volatile PWMPER0STR _PWMPER0 @0x00000494;
#define PWMPER0                         _PWMPER0.Byte
/* PWMPER_ARR: Access 8 PWMPERx registers in an array */
#define PWMPER_ARR                      ((volatile byte *) &PWMPER0)


/*** PWMPER1 - PWM Channel Period 1 Register; 0x00000495 ***/
typedef union {
  byte Byte;
} PWMPER1STR;
extern volatile PWMPER1STR _PWMPER1 @0x00000495;
#define PWMPER1                         _PWMPER1.Byte


/*** PWMPER2 - PWM Channel Period 2 Register; 0x00000496 ***/
typedef union {
  byte Byte;
} PWMPER2STR;
extern volatile PWMPER2STR _PWMPER2 @0x00000496;
#define PWMPER2                         _PWMPER2.Byte


/*** PWMPER3 - PWM Channel Period 3 Register; 0x00000497 ***/
typedef union {
  byte Byte;
} PWMPER3STR;
extern volatile PWMPER3STR _PWMPER3 @0x00000497;
#define PWMPER3                         _PWMPER3.Byte


/*** PWMPER4 - PWM Channel Period 4 Register; 0x00000498 ***/
typedef union {
  byte Byte;
} PWMPER4STR;
extern volatile PWMPER4STR _PWMPER4 @0x00000498;
#define PWMPER4                         _PWMPER4.Byte


/*** PWMPER5 - PWM Channel Period 5 Register; 0x00000499 ***/
typedef union {
  byte Byte;
} PWMPER5STR;
extern volatile PWMPER5STR _PWMPER5 @0x00000499;
#define PWMPER5                         _PWMPER5.Byte


/*** PWMPER6 - PWM Channel Period 6 Register; 0x0000049A ***/
typedef union {
  byte Byte;
} PWMPER6STR;
extern volatile PWMPER6STR _PWMPER6 @0x0000049A;
#define PWMPER6                         _PWMPER6.Byte


/*** PWMPER7 - PWM Channel Period 7 Register; 0x0000049B ***/
typedef union {
  byte Byte;
} PWMPER7STR;
extern volatile PWMPER7STR _PWMPER7 @0x0000049B;
#define PWMPER7                         _PWMPER7.Byte


/*** PWMDTY0 - PWM Channel Duty 0 Register; 0x0000049C ***/
typedef union {
  byte Byte;
} PWMDTY0STR;
extern volatile PWMDTY0STR _PWMDTY0 @0x0000049C;
#define PWMDTY0                         _PWMDTY0.Byte
/* PWMDTY_ARR: Access 8 PWMDTYx registers in an array */
#define PWMDTY_ARR                      ((volatile byte *) &PWMDTY0)


/*** PWMDTY1 - PWM Channel Duty 1 Register; 0x0000049D ***/
typedef union {
  byte Byte;
} PWMDTY1STR;
extern volatile PWMDTY1STR _PWMDTY1 @0x0000049D;
#define PWMDTY1                         _PWMDTY1.Byte


/*** PWMDTY2 - PWM Channel Duty 2 Register; 0x0000049E ***/
typedef union {
  byte Byte;
} PWMDTY2STR;
extern volatile PWMDTY2STR _PWMDTY2 @0x0000049E;
#define PWMDTY2                         _PWMDTY2.Byte


/*** PWMDTY3 - PWM Channel Duty 3 Register; 0x0000049F ***/
typedef union {
  byte Byte;
} PWMDTY3STR;
extern volatile PWMDTY3STR _PWMDTY3 @0x0000049F;
#define PWMDTY3                         _PWMDTY3.Byte


/*** PWMDTY4 - PWM Channel Duty 4 Register; 0x000004A0 ***/
typedef union {
  byte Byte;
} PWMDTY4STR;
extern volatile PWMDTY4STR _PWMDTY4 @0x000004A0;
#define PWMDTY4                         _PWMDTY4.Byte


/*** PWMDTY5 - PWM Channel Duty 5 Register; 0x000004A1 ***/
typedef union {
  byte Byte;
} PWMDTY5STR;
extern volatile PWMDTY5STR _PWMDTY5 @0x000004A1;
#define PWMDTY5                         _PWMDTY5.Byte


/*** PWMDTY6 - PWM Channel Duty 6 Register; 0x000004A2 ***/
typedef union {
  byte Byte;
} PWMDTY6STR;
extern volatile PWMDTY6STR _PWMDTY6 @0x000004A2;
#define PWMDTY6                         _PWMDTY6.Byte


/*** PWMDTY7 - PWM Channel Duty 7 Register; 0x000004A3 ***/
typedef union {
  byte Byte;
} PWMDTY7STR;
extern volatile PWMDTY7STR _PWMDTY7 @0x000004A3;
#define PWMDTY7                         _PWMDTY7.Byte


/*** PMFCFG0 - PMF Configure 0 Register; 0x00000500 ***/
typedef union {
  byte Byte;
  struct {
    byte INDEPA      :1;                                       /* Independent or Complimentary Operation for Pair A */
    byte INDEPB      :1;                                       /* Independent or Complimentary Operation for Pair B */
    byte INDEPC      :1;                                       /* Independent or Complimentary Operation for Pair C */
    byte EDGEA       :1;                                       /* Edge-Aligned or Center-Aligned PWM for Pair A */
    byte EDGEB       :1;                                       /* Edge-Aligned or Center-Aligned PWM for Pair B */
    byte EDGEC       :1;                                       /* Edge-Aligned or Center-Aligned PWM for Pair C */
    byte MTG         :1;                                       /* Multiple Timebase Generators */
    byte WP          :1;                                       /* Write Protect */
  } Bits;
  struct {
    byte grpINDEPx :3;
    byte grpEDGEx :3;
    byte         :1;
    byte         :1;
  } MergedBits;
} PMFCFG0STR;
extern volatile PMFCFG0STR _PMFCFG0 @0x00000500;
#define PMFCFG0                         _PMFCFG0.Byte
#define PMFCFG0_INDEPA                  _PMFCFG0.Bits.INDEPA
#define PMFCFG0_INDEPB                  _PMFCFG0.Bits.INDEPB
#define PMFCFG0_INDEPC                  _PMFCFG0.Bits.INDEPC
#define PMFCFG0_EDGEA                   _PMFCFG0.Bits.EDGEA
#define PMFCFG0_EDGEB                   _PMFCFG0.Bits.EDGEB
#define PMFCFG0_EDGEC                   _PMFCFG0.Bits.EDGEC
#define PMFCFG0_MTG                     _PMFCFG0.Bits.MTG
#define PMFCFG0_WP                      _PMFCFG0.Bits.WP
/* PMFCFG_ARR: Access 4 PMFCFGx registers in an array */
#define PMFCFG_ARR                      ((volatile byte *) &PMFCFG0)
#define PMFCFG0_INDEPx                  _PMFCFG0.MergedBits.grpINDEPx
#define PMFCFG0_EDGEx                   _PMFCFG0.MergedBits.grpEDGEx

#define PMFCFG0_INDEPA_MASK             1U
#define PMFCFG0_INDEPB_MASK             2U
#define PMFCFG0_INDEPC_MASK             4U
#define PMFCFG0_EDGEA_MASK              8U
#define PMFCFG0_EDGEB_MASK              16U
#define PMFCFG0_EDGEC_MASK              32U
#define PMFCFG0_MTG_MASK                64U
#define PMFCFG0_WP_MASK                 128U
#define PMFCFG0_INDEPx_MASK             7U
#define PMFCFG0_INDEPx_BITNUM           0U
#define PMFCFG0_EDGEx_MASK              56U
#define PMFCFG0_EDGEx_BITNUM            3U


/*** PMFCFG1 - PMF Configure 1 Register; 0x00000501 ***/
typedef union {
  byte Byte;
  struct {
    byte TOPNEGA     :1;                                       /* Pair A Top-Side PWM Polarity */
    byte BOTNEGA     :1;                                       /* Pair A Bottom-Side PWM Polarity */
    byte TOPNEGB     :1;                                       /* Pair B Top-Side PWM Polarity */
    byte BOTNEGB     :1;                                       /* Pair B Bottom-Side PWM Polarity */
    byte TOPNEGC     :1;                                       /* Pair C Top-Side PWM Polarity */
    byte BOTNEGC     :1;                                       /* Pair C Bottom-Side PWM Polarity */
    byte ENCE        :1;                                       /* Enable Commutation Event */
    byte             :1; 
  } Bits;
} PMFCFG1STR;
extern volatile PMFCFG1STR _PMFCFG1 @0x00000501;
#define PMFCFG1                         _PMFCFG1.Byte
#define PMFCFG1_TOPNEGA                 _PMFCFG1.Bits.TOPNEGA
#define PMFCFG1_BOTNEGA                 _PMFCFG1.Bits.BOTNEGA
#define PMFCFG1_TOPNEGB                 _PMFCFG1.Bits.TOPNEGB
#define PMFCFG1_BOTNEGB                 _PMFCFG1.Bits.BOTNEGB
#define PMFCFG1_TOPNEGC                 _PMFCFG1.Bits.TOPNEGC
#define PMFCFG1_BOTNEGC                 _PMFCFG1.Bits.BOTNEGC
#define PMFCFG1_ENCE                    _PMFCFG1.Bits.ENCE

